/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* ﺫﻝﺗﻳﺻ۹ﺿﻌﺏﮊﺷﮨﻅﺷﮌﺗﺽﺣﺑﺯﺑﻲﺡﻣ,ﮄﻣﺿﻌﺏﮊﺷﮨﻅﺷﻉ۱ﺣﺊﮌﺗﺽﺣﭼﺯSTCﭖﺥﻉﮌﭼﺵﺙﺍﺏﮊﺷﮨ            */
/*---------------------------------------------------------------------*/

#ifndef	__STC32G_CLOCK_H
#define	__STC32G_CLOCK_H

#include	"FreeRTOS.h"

//========================================================================
//                              ﮌﺎﻅﺽﺭﻟﻅﺣ
//========================================================================

#define		MainClockSel(n)	CLKSEL = (CLKSEL & ~0x0f) | (n)				/* ﺵﭖﺱﺏﮌﺎﻅﺽﺹ۰ﺿﮦ */
#define		PLLClockSel(n)	CLKSEL = (CLKSEL & ~0x80) | (n<<7)		/* PLLﮌﺎﻅﺽﺹ۰ﺿﮦ */
#define		HSIOClockSel(n)	CLKSEL = (CLKSEL & ~0x40) | (n<<6)		/* ﺕﻑﺯﻋIOﮌﺎﻅﺽﺹ۰ﺿﮦ */
#define		PLLClockIn(n)		USBCLK = (USBCLK & ~0x60) | (n<<4)		/* ﺵﭖﺱﺏﮌﺎﻅﺽ n ﺓﻅﺩﭖﻉﺊﺳ۹PLLﮌﺎﻅﺽﺿﺑ,ﺫﺓﺎ۲ﺓﻅﺩﭖﭦﮩﺳ۹12M */
#define		PLLEnable(n)		USBCLK = (USBCLK & ~0x80) | (n<<7)		/* PLLﺎﭘﺩﭖﮌﺗﺥﻎ */
#define		HSClockDiv(n)		HSCLKDIV = (n)		/* ﺕﻑﺯﻋIOﮌﺎﻅﺽﺓﻅﺩﭖﺵﭖﮌﮮ */

//========================================================================
//                              ﭘ۷ﺻﮒﺭﻱﺣﺊ
//========================================================================

/* ﺵﭖﺱﺏﮌﺎﻅﺽﺹ۰ﺿﮦﺎﺳﮌﮮ */
#define MCLKSEL_HIRC       0x00
#define MCLKSEL_XIRC       0x01
#define MCLKSEL_X32K       0x02
#define MCLKSEL_I32K       0x03
#define MCLKSEL_PLL        0x04
#define MCLKSEL_PLL2       0x08
#define MCLKSEL_I48M       0x0c

/* PLLﮌﺎﻅﺽﺹ۰ﺿﮦﺎﺳﮌﮮ */
#define PLL_96M         0
#define PLL_144M        1

/* ﺕﻑﺯﻋIOﮌﺎﻅﺽﺹ۰ﺿﮦﺎﺳﮌﮮ */
#define HSCK_MCLK       0
#define HSCK_PLL        1

/* ﺵﭖﺱﺏﮌﺎﻅﺽ n ﺓﻅﺩﭖﻉﺊﺳ۹PLLﮌﺎﻅﺽﺿﺑﺎﺳﮌﮮ,ﺫﺓﺎ۲ﺓﻅﺩﭖﭦﮩﺳ۹12M */
#define ENCKM           0x80
#define PCKI_MSK        0x60
#define PCKI_D1         0x00
#define PCKI_D2         0x20
#define PCKI_D4         0x40
#define PCKI_D8         0x60

//========================================================================
//                              ﺱﻗﺎﺟﺭﻱﺣﺊ
//========================================================================

void HSPllClkConfig(uint8_t clksrc, uint8_t pllsel, uint8_t div);

#endif
