/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* ﺑﻫ٩ﻝﺯﺕﺷﻏ٣ﺟﺫﻥﺿﺫﺗ٩ﺳﺃ٤ﺛ٤ﻶﺁﺽ,ﺍﺽﺷﻏ٣ﺟﺫﻥﺿﺫﻁﺂﺃﻐﺗ٩ﺳﺃﺀﺛSTC٥ﺅﻁﺗﺀﺩﺱ٠٣ﺟﺫﻥ            */
/*---------------------------------------------------------------------*/

#ifndef __STC32G_USART_H
#define __STC32G_USART_H	 

#include	"FreeRTOS.h"

//========================================================================
//                              ٦ﺎﺯﻣﺓﻵﺃﻐ
//========================================================================

#define	USART1	1
#define	USART2	2

#define FRAME_LEN       8    //ﺗﻱﺹ÷٣¤٦ﺑ: 8 ﻁﺿﺵﻏ

#define	LinMasterMode		0
#define	LinSlaveMode		1

//========================================================================
//                              USARTﺓﻭﺿﺃ
//========================================================================


//========================================================================
//                              ١ﻟﺀ؟ﺓﻵﺃﻐ
//========================================================================

typedef struct
{ 
	uint8_t	LIN_Enable;				//LINﻁ¬ﺩﻉﺗ٩ﺅ¬  	ENABLE,DISABLE
	uint8_t	LIN_Mode;					//LINﻁ¬ﺩﻉﺅ£ﺗﺵ  	LinMasterMode,LinSlaveMode
	uint8_t	LIN_AutoSync;			//ﻁﺷ٦ﺥﺣ،٢ﺵﺗ٩ﺅ¬  	ENABLE,DISABLE
	uint16_t	LIN_Baudrate;			//LIN٢ﺎﺟﻅﺁﺗ
} USARTx_LIN_InitDefine; 

//========================================================================
//                              ﺣﻗ٢؟ﺓﻵﺃﻐ
//========================================================================

uint8_t UASRT_LIN_Configuration(uint8_t USARTx, USARTx_LIN_InitDefine *USART);
void UsartLinSendChecksum(uint8_t USARTx, uint8_t *dat);
void UsartLinSendData(uint8_t USARTx, uint8_t *pdat);
void UsartLinSendFrame(uint8_t USARTx, uint8_t lid, uint8_t *pdat);
void UsartLinSendHeader(uint8_t USARTx, uint8_t lid);

#endif

