/*---------------------------------------------------------------------*
Config.h
*---------------------------------------------------------------------*/

#ifndef        __CONFIG_H
#define        __CONFIG_H

/*---------------------------------------------------------
设置
----------------------------------------------------------*/
#define MAIN_Fosc           11059200UL    //定义主时钟频率
//#define MAIN_Fosc           22118400UL    //定义主时钟频率
//#define MAIN_Fosc           24000000UL    //定义主时钟频率

#define USE_Extern_Fosc     0           //0使用内部时间,1使用外部时钟



/*---------------------------------------------------------
头文件
----------------------------------------------------------*/
#include    <INTRINS.H>
#include    "stc32g.h"
#include    "type_def.h"
#include    <stdlib.h>
#include    <stdio.h>
#include    <string.h>


/*---------------------------------------------------------
不使用UCOS时,自已定义临界区
----------------------------------------------------------*/
#ifndef   OS_uCOS_II_H
#define  OS_ENTER_CRITICAL()    {cpu_sr=((!_testbit_(EA))?0X00:0X80);}
#define  OS_EXIT_CRITICAL()     {IE|=cpu_sr;}
#endif



/*---------------------------------------------------------
位
----------------------------------------------------------*/
#define BIT(X)  (1UL<<X)











#endif
