/**
 * @file Config.h
 * @brief 未指定描述
 * @date 2026 - 6 - 9
 * @version 1.0
 */

/*---------------------------------------------------------------------*
Config.h
*---------------------------------------------------------------------*/

#ifndef        __CONFIG_H
#define        __CONFIG_H

/*---------------------------------------------------------

----------------------------------------------------------*/
#define MAIN_Fosc           11059200UL    //ʱƵ
//#define MAIN_Fosc           22118400UL    //ʱƵ
//#define MAIN_Fosc           24000000UL    //ʱƵ

#define USE_Extern_Fosc     0           //0ʹڲʱ, 1ʹⲿʱ

/*---------------------------------------------------------
ͷļ
----------------------------------------------------------*/
#include    <INTRINS.H>
#include    "stc32g.h"
#include    "type_def.h"
#include    <stdlib.h>
#include    <stdio.h>
#include    <string.h>

/*---------------------------------------------------------
ʹUCOSʱ,Ѷٽ
----------------------------------------------------------*/
#ifndef   OS_uCOS_II_H
#define  OS_ENTER_CRITICAL()    {cpu_sr=((!_testbit_( EA ))?0X00:0X80 );}
#define  OS_EXIT_CRITICAL()     {IE|=cpu_sr;}
#endif

/*---------------------------------------------------------
λ
----------------------------------------------------------*/
#define BIT( X )  (1UL<<X )

#endif
