/*---------------------------------------------------------------------*
Config.h
*---------------------------------------------------------------------*/

#ifndef        __CONFIG_H
#define        __CONFIG_H

/*---------------------------------------------------------
ÉèÖÃ
----------------------------------------------------------*/
#define MAIN_Fosc           11059200UL    //¶¨ÒåÖ÷Ê±ÖÓÆµÂÊ
//#define MAIN_Fosc           22118400UL    //¶¨ÒåÖ÷Ê±ÖÓÆµÂÊ
//#define MAIN_Fosc           24000000UL    //¶¨ÒåÖ÷Ê±ÖÓÆµÂÊ

#define USE_Extern_Fosc     0           //0Ê¹ÓÃÄÚ²¿Ê±¼ä,1Ê¹ÓÃÍâ²¿Ê±ÖÓ



/*---------------------------------------------------------
Í·ÎÄ¼þ
----------------------------------------------------------*/
#include    <INTRINS.H>
#include    "stc32g.h"
#include    "type_def.h"
#include    <stdlib.h>
#include    <stdio.h>
#include    <string.h>


/*---------------------------------------------------------
²»Ê¹ÓÃUCOSÊ±,×ÔÒÑ¶¨ÒåÁÙ½çÇø
----------------------------------------------------------*/
#ifndef   OS_uCOS_II_H
#define  OS_ENTER_CRITICAL()    {cpu_sr=((!_testbit_(EA))?0X00:0X80);}
#define  OS_EXIT_CRITICAL()     {IE|=cpu_sr;}
#endif



/*---------------------------------------------------------
Î»
----------------------------------------------------------*/
#define BIT(X)  (1UL<<X)











#endif
