#include "boot.h"

void boot_init()
{
	P0M1 = 0;   P0M0 = 0;   //ﺭﻟﻅﺣﺳ۹ﻉﺙﺯ،ﺵﮨﺟﻌ
    P1M1 = 0;   P1M0 = 0;   //ﺭﻟﻅﺣﺳ۹ﻉﺙﺯ،ﺵﮨﺟﻌ
    P2M1 = 0;   P2M0 = 0;   //ﺭﻟﻅﺣﺳ۹ﻉﺙﺯ،ﺵﮨﺟﻌ
    P3M1 = 0;   P3M0 = 0;   //ﺭﻟﻅﺣﺳ۹ﻉﺙﺯ،ﺵﮨﺟﻌ
    P4M1 = 0;   P4M0 = 0;   //ﺭﻟﻅﺣﺳ۹ﻉﺙﺯ،ﺵﮨﺟﻌ
    P5M1 = 0;   P5M0 = 0;   //ﺭﻟﻅﺣﺳ۹ﻉﺙﺯ،ﺵﮨﺟﻌ
    P6M1 = 0;   P6M0 = 0;   //ﺭﻟﻅﺣﺳ۹ﻉﺙﺯ،ﺵﮨﺟﻌ
    P7M1 = 0;   P7M0 = 0;   //ﺭﻟﻅﺣﺳ۹ﻉﺙﺯ،ﺵﮨﺟﻌ

	P0 = 0xFF;
	Y4;
	Y0;

	P0 = 0x00;
	Y6;
	Y0;

	P0 = 0xFF;
	Y7;
	Y0;

	P0 = 0xAF;
	Y5;
	Y0;

	timer_1();
	EA = 1;
}

// 1ms
void timer_1()
{
	AUXR &= 0xBF;		//ﭘ۷ﮌﺎﺩﺊﮌﺎﻅﺽ12Tﺥ۲ﮌﺛ
	TMOD &= 0x0F;		//ﺭﻟﻅﺣﭘ۷ﮌﺎﺩﺊﺥ۲ﮌﺛ
	TL1 = 0x18;		//ﺭﻟﻅﺣﭘ۷ﮌﺎﺏﺀﻅﭖ
	TH1 = 0xFC;		//ﺭﻟﻅﺣﭘ۷ﮌﺎﺏﺀﻅﭖ
	TF1 = 0;		//ﮄﮒﺏﮮTF1ﺎﻡﻅﺝ
	TR1 = 1;		//ﭘ۷ﮌﺎﺩﺊ1ﺟ۹ﮌﺙﺙﺩﮌﺎ
	ET1 = 1;	
}




void Delay14us()
{
   unsigned char i;

	_nop_();
	_nop_();
	i = 39;
	while (--i);
}





