/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- BBS: www.STCAIMCU.com  -----------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* Èç¹ûÒªÔÚ³ÌÐòÖÐÊ¹ÓÃ´Ë´úÂë,ÇëÔÚ³ÌÐòÖÐ×¢Ã÷Ê¹ÓÃÁËSTCµÄ×ÊÁÏ¼°³ÌÐò            */
/*---------------------------------------------------------------------*/

#include	"STC32G_I2C.h"

//========================================================================
//                               ±¾µØ±äÁ¿ÉùÃ÷
//========================================================================

I2C_IsrTypeDef I2CIsr;
bit DisplayFlag;

//========================================================================
//                            Íâ²¿º¯ÊýºÍ±äÁ¿ÉùÃ÷
//========================================================================


//========================================================================
// º¯Êý: I2C_ISR_Handler
// ÃèÊö: I2CÖÐ¶Ïº¯Êý.
// ²ÎÊý: none.
// ·µ»Ø: none.
// °æ±¾: V1.0, 2020-09-23
//========================================================================
void I2C_ISR_Handler() interrupt I2C_VECTOR
{
	// TODO: ÔÚ´Ë´¦Ìí¼ÓÓÃ»§´úÂë

	// Ö÷»úÄ£Ê½
	I2CMSST &= ~0x40;       //I2CÖ¸Áî·¢ËÍÍê³É×´Ì¬Çå³ý

	if(DMA_I2C_CR & 0x04)   //ACKERR
	{
		DMA_I2C_CR &= ~0x04;  //·¢Êý¾ÝºóÊÕµ½NAK
	}

	// ´Ó»úÄ£Ê½
	if (I2CSLST & 0x40)
	{
		I2CSLST &= ~0x40;                       //´¦ÀíSTARTÊÂ¼þ
	}
	else if (I2CSLST & 0x20)
	{
		I2CSLST &= ~0x20;                       //´¦ÀíRECVÊÂ¼þ£¬SLACKOÉèÖÃÎª0
		if (I2CIsr.isda)
		{
			I2CIsr.isda = 0;                    //´¦ÀíRECVÊÂ¼þ£¨RECV DEVICE ADDR£©
		}
		else if (I2CIsr.isma)
		{
			I2CIsr.isma = 0;                    //´¦ÀíRECVÊÂ¼þ£¨RECV MEMORY ADDR£©
			I2CIsr.addr = I2CRXD;
			I2CTXD = I2C_Buffer[I2CIsr.addr];
		}
		else
		{
			I2C_Buffer[I2CIsr.addr++] = I2CRXD; //´¦ÀíRECVÊÂ¼þ£¨RECV DATA£©
		}
	}
	else if (I2CSLST & 0x10)
	{
		I2CSLST &= ~0x10;                       //´¦ÀíSENDÊÂ¼þ
		if (I2CSLST & 0x02)
		{
			I2CTXD = 0xff;
		}
		else
		{
			I2CTXD = I2C_Buffer[++I2CIsr.addr];
		}
	}
	else if (I2CSLST & 0x08)
	{
		I2CSLST &= ~0x08;                       //´¦ÀíSTOPÊÂ¼þ
		I2CIsr.isda = 1;
		I2CIsr.isma = 1;
		DisplayFlag = 1;
	}
}

