/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* Èç¹ûÒªÔÚ³ÌÐòÖÐÊ¹ÓÃ´Ë´úÂë,ÇëÔÚ³ÌÐòÖÐ×¢Ã÷Ê¹ÓÃÁËSTCµÄ×ÊÁÏ¼°³ÌÐò            */
/*---------------------------------------------------------------------*/

#ifndef	__STC32G_LCM_H
#define	__STC32G_LCM_H

#include	"config.h"

//========================================================================
//                              ½ÅÎ»¶¨Òå
//========================================================================

sbit LCD_RS = P4^5;      //Êý¾Ý/ÃüÁîÇÐ»»
sbit LCD_WR = P4^2;      //Ð´¿ØÖÆ
sbit LCD_RD = P4^4;      //¶Á¿ØÖÆ
sbit LCD_CS = P3^4;      //Æ¬Ñ¡
sbit LCD_RESET = P4^3;   //¸´Î»

//========================================================================
//                              ¶¨ÒåÉùÃ÷
//========================================================================

#define LCM_WRITE_CMD()					LCMIFCR = ((LCMIFCR & ~0x07) | 0x84)
#define LCM_WRITE_DAT()					LCMIFCR = ((LCMIFCR & ~0x07) | 0x85)
#define LCM_READ_CMD()					LCMIFCR = ((LCMIFCR & ~0x07) | 0x86)
#define LCM_READ_DAT()					LCMIFCR = ((LCMIFCR & ~0x07) | 0x87)

#define SET_LCM_DAT_LOW(n)			LCMIFDATL = (n)
#define SET_LCM_DAT_HIGH(n)			LCMIFDATH = (n)

//========================================================================
//                              ³£Á¿ÉùÃ÷
//========================================================================

#define	MODE_I8080			0	//I8080Ä£Ê½
#define	MODE_M6800			1	//M6800Ä£Ê½

#define	BIT_WIDE_8			0	//8Î»Êý¾Ý¿í¶È
#define	BIT_WIDE_16			2	//16Î»Êý¾Ý¿í¶È

//========================================================================
//                              ±äÁ¿ÉùÃ÷
//========================================================================

typedef struct
{
	u8	LCM_Enable;					//LCM½Ó¿ÚÊ¹ÄÜ  	ENABLE,DISABLE
	u8	LCM_Mode;						//LCM½Ó¿ÚÄ£Ê½  	MODE_I8080,MODE_M6800
	u8	LCM_Bit_Wide;				//LCMÊý¾Ý¿í¶È  	BIT_WIDE_8,BIT_WIDE_16
	u8	LCM_Setup_Time;			//LCMÍ¨ÐÅÊý¾Ý½¨Á¢Ê±¼ä  	0~7
	u8	LCM_Hold_Time;			//LCMÍ¨ÐÅÊý¾Ý±£³ÖÊ±¼ä  	0~3
} LCM_InitTypeDef;


//========================================================================
//                              Íâ²¿ÉùÃ÷
//========================================================================
extern bit LcmFlag;

void LCM_Inilize(LCM_InitTypeDef *LCM);

#endif
