/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- BBS: www.STCAIMCU.com  -----------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* Èç¹ûÒªÔÚ³ÌÐòÖÐÊ¹ÓÃ´Ë´úÂë,ÇëÔÚ³ÌÐòÖÐ×¢Ã÷Ê¹ÓÃÁËSTCµÄ×ÊÁÏ¼°³ÌÐò            */
/*---------------------------------------------------------------------*/

#ifndef	__STC32G_EEPROM_H
#define	__STC32G_EEPROM_H

#include	"config.h"

//========================================================================
//                              ¶¨ÒåÉùÃ÷
//========================================================================


//========================================================================
//                               IAPÉèÖÃ
//========================================================================

#define		IAP_STANDBY()	IAP_CMD = 0		//IAP¿ÕÏÐÃüÁî£¨½ûÖ¹£©
#define		IAP_READ()		IAP_CMD = 1		//IAP¶Á³öÃüÁî
#define		IAP_WRITE()		IAP_CMD = 2		//IAPÐ´ÈëÃüÁî
#define		IAP_ERASE()		IAP_CMD = 3		//IAP²Á³ýÃüÁî

#define	IAP_ENABLE()		IAPEN = 1; IAP_TPS = MAIN_Fosc / 1000000
#define	IAP_DISABLE()		IAP_CONTR = 0; IAP_CMD = 0; IAP_TRIG = 0; IAP_ADDRH = 0xff; IAP_ADDRL = 0xff


void	DisableEEPROM(void);
void 	EEPROM_read_n(u32 EE_address,u8 *DataAddress,u16 number);
void 	EEPROM_write_n(u32 EE_address,u8 *DataAddress,u16 number);
void	EEPROM_SectorErase(u32 EE_address);


#endif