/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- BBS: www.STCAIMCU.com  -----------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* Èç¹ûÒªÔÚ³ÌÐòÖÐÊ¹ÓÃ´Ë´úÂë,ÇëÔÚ³ÌÐòÖÐ×¢Ã÷Ê¹ÓÃÁËSTCµÄ×ÊÁÏ¼°³ÌÐò            */
/*---------------------------------------------------------------------*/

#include	"STC32G_LIN.h"

bit LinRxFlag;

//========================================================================
// º¯Êý: LIN_ISR_Handler
// ÃèÊö: LINÖÐ¶Ïº¯Êý.
// ²ÎÊý: none.
// ·µ»Ø: none.
// °æ±¾: V1.0, 2022-03-28
//========================================================================
void LIN_ISR_Handler (void) interrupt LIN_VECTOR
{
	u8 isr;
	u8 arTemp;
	arTemp = LINAR;     //LINAR ÏÖ³¡±£´æ£¬±ÜÃâÖ÷Ñ­»·ÀïÐ´Íê LINAR ºó²úÉúÖÐ¶Ï£¬ÔÚÖÐ¶ÏÀïÐÞ¸ÄÁË LINAR ÄÚÈÝ
	
	isr = LinReadReg(LSR);		//¶ÁÈ¡¼Ä´æÆ÷Çå³ý×´Ì¬±êÖ¾Î»
	if((isr & 0x03) == 0x03)
	{
		isr = LinReadReg(LER);
		if(isr == 0x00)		//No Error
		{
			LinRxFlag = 1;
		}
	}
	else
	{
		isr = LinReadReg(LER);	//¶ÁÈ¡Çå³ý´íÎó¼Ä´æÆ÷
	}

	LINAR = arTemp;    //LINAR ÏÖ³¡»Ö¸´
}


