/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- BBS: www.STCAIMCU.com  -----------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* Èç¹ûÒªÔÚ³ÌÐòÖÐÊ¹ÓÃ´Ë´úÂë,ÇëÔÚ³ÌÐòÖÐ×¢Ã÷Ê¹ÓÃÁËSTCµÄ×ÊÁÏ¼°³ÌÐò            */
/*---------------------------------------------------------------------*/

#include	"STC32G_Exti.h"

//========================================================================
// º¯Êý: u8	Ext_Inilize(u8 EXT, EXTI_InitTypeDef *INTx)
// ÃèÊö: Íâ²¿ÖÐ¶Ï³õÊ¼»¯³ÌÐò.
// ²ÎÊý: EXT: Íâ²¿ÖÐ¶ÏºÅ, INTx: ½á¹¹²ÎÊý,Çë²Î¿¼Exti.hÀïµÄ¶¨Òå.
// ·µ»Ø: ³É¹¦·µ»Ø SUCCESS, ´íÎó·µ»Ø FAIL.
// °æ±¾: V1.0, 2012-10-22
//========================================================================
u8	Ext_Inilize(u8 EXT, EXTI_InitTypeDef *INTx)
{
	if(EXT >  EXT_INT1)	return FAIL;	//¿Õ²Ù×÷
	
	if(EXT == EXT_INT0)	//ÍâÖÐ¶Ï0
	{
		IE0  = 0;					//ÍâÖÐ¶Ï0±êÖ¾Î»
		INT0_Mode(INTx->EXTI_Mode);
		return SUCCESS;		//³É¹¦
	}

	if(EXT == EXT_INT1)	//ÍâÖÐ¶Ï1
	{
		IE1  = 0;					//ÍâÖÐ¶Ï1±êÖ¾Î»
		INT1_Mode(INTx->EXTI_Mode);
		return SUCCESS;		//³É¹¦
	}
	return FAIL;	//Ê§°Ü
}
