/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- BBS: www.STCAIMCU.com  -----------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* Èç¹ûÒªÔÚ³ÌÐòÖÐÊ¹ÓÃ´Ë´úÂë,ÇëÔÚ³ÌÐòÖÐ×¢Ã÷Ê¹ÓÃÁËSTCµÄ×ÊÁÏ¼°³ÌÐò            */
/*---------------------------------------------------------------------*/

#ifndef	__STC32G_RTC_H
#define	__STC32G_RTC_H

#include	"config.h"

//========================================================================
//                              ¶¨ÒåÉùÃ÷
//========================================================================

#define RTC_IRC32KCR		0		//RTCÊ±ÖÓÔ´Ê¹ÓÃÄÚ²¿32KÊ±ÖÓ
#define RTC_X32KCR			1		//RTCÊ±ÖÓÔ´Ê¹ÓÃÍâ²¿32K¾§Õñ

//ÖÐ¶ÏÊ¹ÄÜ, 0x80:ÄÖÖÓÖÐ¶Ï, 0x40:ÈÕÖÐ¶Ï, 0x20:Ð¡Ê±ÖÐ¶Ï, 0x10:·ÖÖÓÖÐ¶Ï, 0x08:ÃëÖÐ¶Ï, 0x04:1/2ÃëÖÐ¶Ï, 0x02:1/8ÃëÖÐ¶Ï, 0x01:1/32ÃëÖÐ¶Ï
#define RTC_ALARM_INT		0x80		//RTC ÄÖÖÓÖÐ¶Ï
#define RTC_DAY_INT			0x40		//RTC ÈÕÖÐ¶Ï
#define RTC_HOUR_INT		0x20		//RTC Ð¡Ê±ÖÐ¶Ï
#define RTC_MIN_INT			0x10		//RTC ·ÖÖÓÖÐ¶Ï
#define RTC_SEC_INT			0x08		//RTC ÃëÖÐ¶Ï
#define RTC_SEC2_INT		0x04		//RTC 1/2ÃëÖÐ¶Ï
#define RTC_SEC8_INT		0x02		//RTC 1/8ÃëÖÐ¶Ï
#define RTC_SEC32_INT		0x01		//RTC 1/32ÃëÖÐ¶Ï

typedef struct
{
	u8	RTC_Enable;		//RTC Ê¹ÄÜ, ENABLE, DISABLE
	u8	RTC_Clock;		//RTC Ê±ÖÓ, RTC_IRC32KCR, RTC_X32KCR
	u8	RTC_Year;			//RTC Äê, 00~99, ¶ÔÓ¦2000~2099Äê
	u8	RTC_Month;		//RTC ÔÂ, 01~12
	u8	RTC_Day;			//RTC ÈÕ, 01~31
	u8	RTC_Hour;			//RTC Ê±, 00~23
	u8	RTC_Min;			//RTC ·Ö, 00~59
	u8	RTC_Sec;			//RTC Ãë, 00~59
	u8	RTC_Ssec;			//RTC 1/128Ãë, 00~127

	u8	RTC_ALAHour;	//RTC ÄÖÖÓÊ±, 00~23
	u8	RTC_ALAMin;		//RTC ÄÖÖÓ·Ö, 00~59
	u8	RTC_ALASec;		//RTC ÄÖÖÓÃë, 00~59
	u8	RTC_ALASsec;	//RTC ÄÖÖÓ1/128Ãë, 00~127
} RTC_InitTypeDef;

u8	RTC_Inilize(RTC_InitTypeDef *RTCx);

#endif
