/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- BBS: www.STCAIMCU.com  -----------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* Èç¹ûÒªÔÚ³ÌÐòÖÐÊ¹ÓÃ´Ë´úÂë,ÇëÔÚ³ÌÐòÖÐ×¢Ã÷Ê¹ÓÃÁËSTCµÄ×ÊÁÏ¼°³ÌÐò            */
/*---------------------------------------------------------------------*/

#ifndef	__STC32G_TIMER_H
#define	__STC32G_TIMER_H

#include	"config.h"

//========================================================================
//                             ¶¨Ê±Æ÷0ÉèÖÃ
//========================================================================

/* 0,1: ¶¨Ê±Æ÷0ÓÃ×ö¶¨Ê±Æ÷, 12T/1T; 2: ¶¨Ê±Æ÷0ÓÃ×ö¼ÆÊýÆ÷	*/
#define 	Timer0_CLK_Select(n)	do{if(n == 0) T0x12 = 0, T0_CT = 0; \
																if(n == 1) T0x12 = 1, T0_CT = 0; \
																if(n == 2) T0_CT = 1; \
																}while(0)

#define		Timer0_CLK_Output(n)	T0CLKO = n	/* T0 Òç³öÂö³åÔÚT0½ÅÊä³öÊ¹ÄÜ */
#define 	Timer0_Run(n)					(n==0?(TR0 = 0):(TR0 = 1))				/* ¶¨Ê±Æ÷0¼ÆÊýÊ¹ÄÜ */
#define 	Timer0_Stop()	 				TR0 = 0				/* ½ûÖ¹¶¨Ê±Æ÷0¼ÆÊý */
#define		T0_Load(n)						TH0 = (n) / 256,	TL0 = (n) % 256

//========================================================================
//                             ¶¨Ê±Æ÷1ÉèÖÃ
//========================================================================

/* 0,1: ¶¨Ê±Æ÷1ÓÃ×ö¶¨Ê±Æ÷, 12T/1T; 2: ¶¨Ê±Æ÷1ÓÃ×ö¼ÆÊýÆ÷	*/
#define 	Timer1_CLK_Select(n)	do{if(n == 0) T1x12 = 0, T1_CT = 0; \
																if(n == 1) T1x12 = 1, T1_CT = 0; \
																if(n == 2) T1_CT = 1; \
																}while(0)

#define		Timer1_CLK_Output(n)	T1CLKO = n	/* T1 Òç³öÂö³åÔÚT1½ÅÊä³öÊ¹ÄÜ */
#define 	Timer1_Run(n)					(n==0?(TR1 = 0):(TR1 = 1))				/* ¶¨Ê±Æ÷1¼ÆÊýÊ¹ÄÜ */
#define 	Timer1_Stop()	 				TR1 = 0				/* ½ûÖ¹¶¨Ê±Æ÷1¼ÆÊý */
#define		T1_Load(n)						TH1 = (n) / 256,	TL1 = (n) % 256

//========================================================================
//                             ¶¨Ê±Æ÷2ÉèÖÃ
//========================================================================

/* 0,1: ¶¨Ê±Æ÷2ÓÃ×ö¶¨Ê±Æ÷, 12T/1T; 2: ¶¨Ê±Æ÷2ÓÃ×ö¼ÆÊýÆ÷	*/
#define 	Timer2_CLK_Select(n)	do{if(n == 0) T2x12 = 0, T2_CT = 0; \
																if(n == 1) T2x12 = 1, T2_CT = 0; \
																if(n == 2) T2_CT = 1; \
																}while(0)

#define		Timer2_CLK_Output(n)	T2CLKO = n	/* T2 Òç³öÂö³åÔÚT2½ÅÊä³öÊ¹ÄÜ */
#define 	Timer2_Run(n)					(n==0?(T2R = 0):(T2R = 1))		/* ¶¨Ê±Æ÷2¼ÆÊýÊ¹ÄÜ */
#define 	Timer2_Stop()	 				T2R = 0		/* ½ûÖ¹¶¨Ê±Æ÷2¼ÆÊý	*/
#define		T2_Load(n)						T2H = (n) / 256,	T2L = (n) % 256

//========================================================================
//                             ¶¨Ê±Æ÷3ÉèÖÃ
//========================================================================

/* 0,1: ¶¨Ê±Æ÷3ÓÃ×ö¶¨Ê±Æ÷, 12T/1T; 2: ¶¨Ê±Æ÷3ÓÃ×ö¼ÆÊýÆ÷	*/
#define 	Timer3_CLK_Select(n)	do{if(n == 0) T3x12 = 0, T3_CT = 0; \
																if(n == 1) T3x12 = 1, T3_CT = 0; \
																if(n == 2) T3_CT = 1; \
																}while(0)

#define		Timer3_CLK_Output(n)	T3CLKO = n				/* T3 Òç³öÂö³åÔÚT3½ÅÊä³öÊ¹ÄÜ */
#define 	Timer3_Run(n)					(n==0?(T3R = 0):(T3R = 1))	/* ¶¨Ê±Æ÷3¼ÆÊýÊ¹ÄÜ */
#define 	Timer3_Stop()	 				T3R = 0	/* ½ûÖ¹¶¨Ê±Æ÷3¼ÆÊý	*/
#define		T3_Load(n)						T3H = (n) / 256,	T3L = (n) % 256

//========================================================================
//                             ¶¨Ê±Æ÷4ÉèÖÃ
//========================================================================

/* 0,1: ¶¨Ê±Æ÷4ÓÃ×ö¶¨Ê±Æ÷, 12T/1T; 2: ¶¨Ê±Æ÷4ÓÃ×ö¼ÆÊýÆ÷	*/
#define 	Timer4_CLK_Select(n)	do{if(n == 0) T4x12 = 0, T4_CT = 0; \
																if(n == 1) T4x12 = 1, T4_CT = 0; \
																if(n == 2) T4_CT = 1; \
																}while(0)

#define		Timer4_CLK_Output(n)	T4CLKO = n	/* T4 Òç³öÂö³åÔÚT4½ÅÊä³öÊ¹ÄÜ */
#define 	Timer4_Run(n)					(n==0?(T4R = 0):(T4R = 1))	/* ¶¨Ê±Æ÷4¼ÆÊýÊ¹ÄÜ */
#define 	Timer4_Stop()	 				T4R = 0	/* ½ûÖ¹¶¨Ê±Æ÷4¼ÆÊý	*/
#define		T4_Load(n)						T4H = (n) / 256,	T4L = (n) % 256

//========================================================================
//                              ¶¨ÒåÉùÃ÷
//========================================================================

#define	Timer0						0
#define	Timer1						1
#define	Timer2						2
#define	Timer3						3
#define	Timer4						4

#define	TIM_16BitAutoReload				0
#define	TIM_16Bit									1
#define	TIM_8BitAutoReload				2
#define	TIM_16BitAutoReloadNoMask	3
#define	TIM_T1Stop								3

#define	TIM_CLOCK_12T				0
#define	TIM_CLOCK_1T				1
#define	TIM_CLOCK_Ext				2

typedef struct
{
	u8	TIM_Mode;		//¹¤×÷Ä£Ê½,  	TIM_16BitAutoReload,TIM_16Bit,TIM_8BitAutoReload,TIM_16BitAutoReloadNoMask
	u8	TIM_ClkSource;	//Ê±ÖÓÔ´		TIM_CLOCK_1T,TIM_CLOCK_12T,TIM_CLOCK_Ext
	u8	TIM_ClkOut;		//¿É±à³ÌÊ±ÖÓÊä³ö,	ENABLE,DISABLE
	u16	TIM_Value;		//×°ÔØ³õÖµ
	u8	TIM_Run;		//ÊÇ·ñÔËÐÐ		ENABLE,DISABLE
} TIM_InitTypeDef;

u8	Timer_Inilize(u8 TIM, TIM_InitTypeDef *TIMx);

#endif
