/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- BBS: www.STCAIMCU.com  -----------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* Èç¹ûÒªÔÚ³ÌÐòÖÐÊ¹ÓÃ´Ë´úÂë,ÇëÔÚ³ÌÐòÖÐ×¢Ã÷Ê¹ÓÃÁËSTCµÄ×ÊÁÏ¼°³ÌÐò            */
/*---------------------------------------------------------------------*/

#include	"STC32G_WDT.h"

//========================================================================
// º¯Êý: void WDT_Inilize(WDT_InitTypeDef *WDT)
// ÃèÊö: ¿´ÃÅ¹·³õÊ¼»¯³ÌÐò.
// ²ÎÊý: WDT: ½á¹¹²ÎÊý,Çë²Î¿¼WDT.hÀïµÄ¶¨Òå.
// ·µ»Ø: none.
// °æ±¾: V1.0, 2020-09-16
//========================================================================
void WDT_Inilize(WDT_InitTypeDef *WDT)
{
	if(WDT->WDT_Enable == ENABLE)		EN_WDT = 1;	//Ê¹ÄÜ¿´ÃÅ¹·

	WDT_PS_Set(WDT->WDT_PS);	//¿´ÃÅ¹·¶¨Ê±Æ÷Ê±ÖÓ·ÖÆµÏµÊý		WDT_SCALE_2,WDT_SCALE_4,WDT_SCALE_8,WDT_SCALE_16,WDT_SCALE_32,WDT_SCALE_64,WDT_SCALE_128,WDT_SCALE_256
	if(WDT->WDT_IDLE_Mode == WDT_IDLE_STOP)	IDL_WDT = 0;	//IDLEÄ£Ê½Í£Ö¹¼ÆÊý
	else									IDL_WDT = 1;	//IDLEÄ£Ê½¼ÌÐø¼ÆÊý
}

/********************* Çå³ý¿´ÃÅ¹·º¯Êý *************************/
void WDT_Clear (void)
{
	CLR_WDT = 1;    // Î¹¹·
}
