/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- BBS: www.STCAIMCU.com  -----------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* Èç¹ûÒªÔÚ³ÌÐòÖÐÊ¹ÓÃ´Ë´úÂë,ÇëÔÚ³ÌÐòÖÐ×¢Ã÷Ê¹ÓÃÁËSTCµÄ×ÊÁÏ¼°³ÌÐò            */
/*---------------------------------------------------------------------*/

#include	"STC32G_I2C.h"

u8 I2C_BUF_type I2C_Buffer[I2C_BUF_LENTH];

#define SLAW    0xA2
#define SLAR    0xA3

//========================================================================
// º¯Êý: void I2C_Init(I2C_InitTypeDef *I2Cx)
// ÃèÊö: I2C³õÊ¼»¯³ÌÐò.
// ²ÎÊý: I2Cx: ½á¹¹²ÎÊý,Çë²Î¿¼I2C.hÀïµÄ¶¨Òå.
// ·µ»Ø: none.
// °æ±¾: V1.0, 2012-11-22
//========================================================================
void I2C_Init(I2C_InitTypeDef *I2Cx)
{
	if(I2Cx->I2C_Mode == I2C_Mode_Master)
	{
		I2C_Master();			//ÉèÎªÖ÷»ú	
		I2CMSST = 0x00;		//Çå³ýI2CÖ÷»ú×´Ì¬¼Ä´æÆ÷
		I2C_SetSpeed(I2Cx->I2C_Speed);
		if(I2Cx->I2C_MS_WDTA == ENABLE)		I2C_WDTA_EN();	//Ê¹ÄÜ×Ô¶¯·¢ËÍ
		else									I2C_WDTA_DIS();	//½ûÖ¹×Ô¶¯·¢ËÍ
	}
	else
	{
		I2C_Slave();	//ÉèÎª´Ó»ú
		I2CSLST = 0x00;		//Çå³ýI2C´Ó»ú×´Ì¬¼Ä´æÆ÷
		I2C_Address(I2Cx->I2C_SL_ADR);
		if(I2Cx->I2C_SL_MA == ENABLE)		I2C_MATCH_EN();	//´Ó»úµØÖ·±È½Ï¹¦ÄÜ£¬Ö»½ÓÊÜÏàÆ¥ÅäµØÖ·
		else									I2C_MATCH_DIS();	//½ûÖ¹´Ó»úµØÖ·±È½Ï¹¦ÄÜ£¬½ÓÊÜËùÓÐÉè±¸µØÖ·
	}
	
	I2C_Function(I2Cx->I2C_Enable);
}

//========================================================================
// º¯Êý: u8	Get_MSBusy_Status (void)
// ÃèÊö: »ñÈ¡Ö÷»úÃ¦Âµ×´Ì¬.
// ²ÎÊý: none.
// ·µ»Ø: Ö÷»úÃ¦Âµ×´Ì¬.
// °æ±¾: V1.0, 2012-11-22
//========================================================================
u8 Get_MSBusy_Status(void)
{
	return (I2CMSST & 0x80);
}

//========================================================================
// º¯Êý: void	Wait (void)
// ÃèÊö: µÈ´ýÖ÷»úÄ£Ê½I2C¿ØÖÆÆ÷Ö´ÐÐÍê³ÉI2CMSCR.
// ²ÎÊý: none.
// ·µ»Ø: none.
// °æ±¾: V1.0, 2012-11-22
//========================================================================
void Wait()
{
	while (!(I2CMSST & 0x40));
	I2CMSST &= ~0x40;
}

//========================================================================
// º¯Êý: void Start (void)
// ÃèÊö: I2C×ÜÏßÆðÊ¼º¯Êý.
// ²ÎÊý: none.
// ·µ»Ø: none.
// °æ±¾: V1.0, 2020-09-15
//========================================================================
void Start()
{
	I2CMSCR = 0x01;                         //·¢ËÍSTARTÃüÁî
	Wait();
}

//========================================================================
// º¯Êý: void SendData (char dat)
// ÃèÊö: I2C·¢ËÍÒ»¸ö×Ö½ÚÊý¾Ýº¯Êý.
// ²ÎÊý: ·¢ËÍµÄÊý¾Ý.
// ·µ»Ø: none.
// °æ±¾: V1.0, 2020-09-15
//========================================================================
void SendData(char dat)
{
	I2CTXD = dat;                           //Ð´Êý¾Ýµ½Êý¾Ý»º³åÇø
	I2CMSCR = 0x02;                         //·¢ËÍSENDÃüÁî
	Wait();
}

//========================================================================
// º¯Êý: void RecvACK (void)
// ÃèÊö: I2C»ñÈ¡ACKº¯Êý.
// ²ÎÊý: none.
// ·µ»Ø: none.
// °æ±¾: V1.0, 2020-09-15
//========================================================================
void RecvACK()
{
	I2CMSCR = 0x03;                         //·¢ËÍ¶ÁACKÃüÁî
	Wait();
}

//========================================================================
// º¯Êý: char RecvData (void)
// ÃèÊö: I2C¶ÁÈ¡Ò»¸ö×Ö½ÚÊý¾Ýº¯Êý.
// ²ÎÊý: none.
// ·µ»Ø: ¶ÁÈ¡Êý¾Ý.
// °æ±¾: V1.0, 2020-09-15
//========================================================================
char RecvData()
{
	I2CMSCR = 0x04;                         //·¢ËÍRECVÃüÁî
	Wait();
	return I2CRXD;
}

//========================================================================
// º¯Êý: void SendACK (void)
// ÃèÊö: I2C·¢ËÍACKº¯Êý.
// ²ÎÊý: none.
// ·µ»Ø: none.
// °æ±¾: V1.0, 2020-09-15
//========================================================================
void SendACK()
{
	I2CMSST = 0x00;                         //ÉèÖÃACKÐÅºÅ
	I2CMSCR = 0x05;                         //·¢ËÍACKÃüÁî
	Wait();
}

//========================================================================
// º¯Êý: void SendNAK (void)
// ÃèÊö: I2C·¢ËÍNAKº¯Êý.
// ²ÎÊý: none.
// ·µ»Ø: none.
// °æ±¾: V1.0, 2020-09-15
//========================================================================
void SendNAK()
{
	I2CMSST = 0x01;                         //ÉèÖÃNAKÐÅºÅ
	I2CMSCR = 0x05;                         //·¢ËÍACKÃüÁî
	Wait();
}

//========================================================================
// º¯Êý: void Stop (void)
// ÃèÊö: I2C×ÜÏßÍ£Ö¹º¯Êý.
// ²ÎÊý: none.
// ·µ»Ø: none.
// °æ±¾: V1.0, 2020-09-15
//========================================================================
void Stop()
{
	I2CMSCR = 0x06;                         //·¢ËÍSTOPÃüÁî
	Wait();
}

//========================================================================
// º¯Êý: void SendCmdData (u8 cmd, u8 dat)
// ÃèÊö: I2C·¢ËÍÒ»¸ö×Ö½ÚÊý¾Ýº¯Êý.
// ²ÎÊý: ÃüÁî/Êý¾Ý.
// ·µ»Ø: none.
// °æ±¾: V1.0, 2020-09-15
//========================================================================
void SendCmdData(u8 cmd, u8 dat)
{
	I2CTXD = dat;                           //Ð´Êý¾Ýµ½Êý¾Ý»º³åÇø
	I2CMSCR = cmd;                          //ÉèÖÃÃüÁî
	Wait();
}

//========================================================================
// º¯Êý: void I2C_WriteNbyte(u8 dev_addr, u8 mem_addr, u8 *p, u8 number)
// ÃèÊö: I2CÐ´ÈëÊý¾Ýº¯Êý.
// ²ÎÊý: dev_addr: Éè±¸µØÖ·, mem_addr: ´æ´¢µØÖ·, *pÐ´ÈëÊý¾Ý´æ´¢Î»ÖÃ, numberÐ´ÈëÊý¾Ý¸öÊý.
// ·µ»Ø: none.
// °æ±¾: V1.0, 2020-09-15
//========================================================================
void I2C_WriteNbyte(u8 dev_addr, u8 mem_addr, u8 *p, u8 number)  /*  DeviceAddress,WordAddress,First Data Address,Byte lenth   */
{
	Start();                                //·¢ËÍÆðÊ¼ÃüÁî
	SendData(dev_addr);                     //·¢ËÍÉè±¸µØÖ·+Ð´ÃüÁî
	RecvACK();
	SendData(mem_addr);                     //·¢ËÍ´æ´¢µØÖ·
	RecvACK();
	do
	{
		SendData(*p++);
		RecvACK();
	}
	while(--number);
	Stop();                                 //·¢ËÍÍ£Ö¹ÃüÁî
}

//========================================================================
// º¯Êý: void I2C_ReadNbyte(u8 dev_addr, u8 mem_addr, u8 *p, u8 number)
// ÃèÊö: I2C¶ÁÈ¡Êý¾Ýº¯Êý.
// ²ÎÊý: dev_addr: Éè±¸µØÖ·, mem_addr: ´æ´¢µØÖ·, *p¶ÁÈ¡Êý¾Ý´æ´¢Î»ÖÃ, number¶ÁÈ¡Êý¾Ý¸öÊý.
// ·µ»Ø: none.
// °æ±¾: V1.0, 2020-09-15
//========================================================================
void I2C_ReadNbyte(u8 dev_addr, u8 mem_addr, u8 *p, u8 number)   /*  DeviceAddress,WordAddress,First Data Address,Byte lenth   */
{
	Start();                                //·¢ËÍÆðÊ¼ÃüÁî
	SendData(dev_addr);                     //·¢ËÍÉè±¸µØÖ·+Ð´ÃüÁî
	RecvACK();
	SendData(mem_addr);                     //·¢ËÍ´æ´¢µØÖ·
	RecvACK();
	Start();                                //·¢ËÍÆðÊ¼ÃüÁî
	SendData(dev_addr|1);                   //·¢ËÍÉè±¸µØÖ·+¶ÁÃüÁî
	RecvACK();
	do
	{
		*p = RecvData();
		p++;
		if(number != 1) SendACK();          //send ACK
	}
	while(--number);
	SendNAK();                              //send no ACK	
	Stop();                                 //·¢ËÍÍ£Ö¹ÃüÁî
}
