/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- BBS: www.STCAIMCU.com  -----------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* Èç¹ûÒªÔÚ³ÌÐòÖÐÊ¹ÓÃ´Ë´úÂë,ÇëÔÚ³ÌÐòÖÐ×¢Ã÷Ê¹ÓÃÁËSTCµÄ×ÊÁÏ¼°³ÌÐò            */
/*---------------------------------------------------------------------*/

#ifndef	__STC32G_CAN_H
#define	__STC32G_CAN_H

#include	"config.h"

//========================================================================
//                              ¶¨ÒåÉùÃ÷
//========================================================================

#define	CAN1	0
#define	CAN2	1

#define	STANDARD_FRAME   0     //Ö¡¸ñÊ½£º±ê×¼Ö¡
#define	EXTENDED_FRAME   1     //Ö¡¸ñÊ½£ºÀ©Õ¹Ö¡

//========================================================================
//                              ³£Á¿ÉùÃ÷
//========================================================================

#define CAN_DOIM     0x01  //½ÓÊÕÒç³öÖÐ¶Ï
#define CAN_BEIM     0x02  //×ÜÏß´íÎ»ÖÐ¶Ï
#define CAN_TIM      0x04  //·¢ËÍÖÐ¶Ï
#define CAN_RIM      0x08  //½ÓÊÕÖÐ¶Ï
#define CAN_EPIM     0x10  //±»¶¯´íÎ»ÖÐ¶Ï
#define CAN_EWIM     0x20  //´íÎ»¾¯¸æÖÐ¶Ï
#define CAN_ALIM     0x40  //ÖÙ²Ã¶ªÊ§ÖÐ¶Ï
#define CAN_ALLIM    0x7F  //ËùÓÐÖÐ¶Ï

//========================================================================
//                              ±äÁ¿ÉùÃ÷
//========================================================================

typedef struct
{
	u8	CAN_Enable;					//CAN¹¦ÄÜÊ¹ÄÜ  	ENABLE,DISABLE
	u8	CAN_IMR;						//CANÖÐ¶Ï¼Ä´æÆ÷ 	CAN_DOIM,CAN_BEIM,CAN_TIM,CAN_RIM,CAN_EPIM,CAN_EWIM,CAN_ALIM,CAN_ALLIM,DISABLE
	u8	CAN_SJW;						//ÖØÐÂÍ¬²½ÌøÔ¾¿í¶È  0~3
	u8	CAN_BRP;						//²¨ÌØÂÊ·ÖÆµÏµÊý    0~63
	u8	CAN_SAM;						//×ÜÏßµçÆ½²ÉÑù´ÎÊý  0:²ÉÑù1´Î; 1:²ÉÑù3´Î
	u8	CAN_TSG1;						//Í¬²½²ÉÑù¶Î1       0~15
	u8	CAN_TSG2;						//Í¬²½²ÉÑù¶Î2       1~7 (TSG2 ²»ÄÜÉèÖÃÎª0)

	u8	CAN_ACR0;						//×ÜÏßÑéÊÕ´úÂë¼Ä´æÆ÷ 0~0xFF
	u8	CAN_ACR1;						//×ÜÏßÑéÊÕ´úÂë¼Ä´æÆ÷ 0~0xFF
	u8	CAN_ACR2;						//×ÜÏßÑéÊÕ´úÂë¼Ä´æÆ÷ 0~0xFF
	u8	CAN_ACR3;						//×ÜÏßÑéÊÕ´úÂë¼Ä´æÆ÷ 0~0xFF
	u8	CAN_AMR0;						//×ÜÏßÑéÊÕÆÁ±Î¼Ä´æÆ÷ 0~0xFF
	u8	CAN_AMR1;						//×ÜÏßÑéÊÕÆÁ±Î¼Ä´æÆ÷ 0~0xFF
	u8	CAN_AMR2;						//×ÜÏßÑéÊÕÆÁ±Î¼Ä´æÆ÷ 0~0xFF
	u8	CAN_AMR3;						//×ÜÏßÑéÊÕÆÁ±Î¼Ä´æÆ÷ 0~0xFF
} CAN_InitTypeDef;

typedef struct
{
	u8	DLC:4;          //Êý¾Ý³¤¶È, bit0~bit3
	u8	:2;             //¿ÕÊý¾Ý, bit4~bit5
	u8	RTR:1;          //Ö¡ÀàÐÍ, bit6
	u8	FF:1;           //Ö¡¸ñÊ½, bit7
	u32	ID;             //CAN ID
	u8	DataBuffer[8];  //Êý¾Ý»º´æ
}CAN_DataDef;

//========================================================================
//                              Íâ²¿ÉùÃ÷
//========================================================================
extern bit B_Can1Read;     //CAN ÊÕµ½Êý¾Ý±êÖ¾
extern bit B_Can2Read;     //CAN ÊÕµ½Êý¾Ý±êÖ¾

extern CAN_DataDef CAN1_Tx;
extern CAN_DataDef CAN1_Rx[8];
extern CAN_DataDef CAN2_Tx;
extern CAN_DataDef CAN2_Rx[8];


u8 CanReadReg(u8 addr);
void CAN_Inilize(u8 CANx, CAN_InitTypeDef *CAN);
u8 CanReadMsg(CAN_DataDef *CAN);
void CanSendMsg(CAN_DataDef *CAN);

#endif
