/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- BBS: www.STCAIMCU.com  -----------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* Èç¹ûÒªÔÚ³ÌÐòÖÐÊ¹ÓÃ´Ë´úÂë,ÇëÔÚ³ÌÐòÖÐ×¢Ã÷Ê¹ÓÃÁËSTCµÄ×ÊÁÏ¼°³ÌÐò            */
/*---------------------------------------------------------------------*/

#include	"STC32G_Clock.h"
#include	"STC32G_Delay.h"

//========================================================================
// º¯Êý: void HIRCClkConfig(u8 div)
// ÃèÊö: ¸ßËÙIRCÊ±ÖÓ³õÊ¼»¯³ÌÐò.
// ²ÎÊý: div: Ê±ÖÓ·ÖÆµÏµÊý.
// ·µ»Ø: none.
// °æ±¾: V1.0, 2022-04-03
//========================================================================
void HIRCClkConfig(u8 div)
{
	HIRCCR = 0x80; //Æô¶¯ÄÚ²¿ IRC
	while (!(HIRCCR & 1)); //µÈ´ýÊ±ÖÓÎÈ¶¨
	CLKDIV = div;
	CLKSEL = 0x00; //Ñ¡ÔñÄÚ²¿ IRC ( Ä¬ÈÏ )
}

//========================================================================
// º¯Êý: void XOSCClkConfig(u8 div)
// ÃèÊö: Íâ²¿¾§ÕñÊ±ÖÓ³õÊ¼»¯³ÌÐò.
// ²ÎÊý: div: Ê±ÖÓ·ÖÆµÏµÊý.
// ·µ»Ø: none.
// °æ±¾: V1.0, 2022-04-03
//========================================================================
void XOSCClkConfig(u8 div)
{
	XOSCCR = 0xc0; //Æô¶¯Íâ²¿¾§Õñ
	while (!(XOSCCR & 1)); //µÈ´ýÊ±ÖÓÎÈ¶¨
	CLKDIV = div;  //Ê±ÖÓ·ÖÆµ
	CLKSEL = 0x01; //Ñ¡ÔñÍâ²¿¾§Õñ
}

//========================================================================
// º¯Êý: void IRC32KClkConfig(u8 div)
// ÃèÊö: µÍËÙ32K IRCÊ±ÖÓ³õÊ¼»¯³ÌÐò.
// ²ÎÊý: div: Ê±ÖÓ·ÖÆµÏµÊý.
// ·µ»Ø: none.
// °æ±¾: V1.0, 2022-04-03
//========================================================================
void IRC32KClkConfig(u8 div)
{
	IRC32KCR = 0x80; //Æô¶¯ÄÚ²¿ 32K IRC
	while (!(IRC32KCR & 1)); //µÈ´ýÊ±ÖÓÎÈ¶¨
	CLKDIV = div;  //Ê±ÖÓ·ÖÆµ
	CLKSEL = 0x03; //Ñ¡ÔñÄÚ²¿ 32K
}

//========================================================================
// º¯Êý: void HSPllClkConfig(u8 clksrc, u8 pcki, u8 pllsel, u8 div)
// ÃèÊö: ¸ßËÙIOÊ±ÖÓ³õÊ¼»¯³ÌÐò.
// ²ÎÊý: clksrc: ÏµÍ³Ê±ÖÓÑ¡Ôñ, MCLKSEL_HIRC/MCLKSEL_XIRC/MCLKSEL_X32K/MCLKSEL_I32K/MCLKSEL_PLL/MCLKSEL_PLL2/MCLKSEL_I48M.
// ²ÎÊý: pllsel: PLLÊ±ÖÓÑ¡Ôñ, PLL_96M/PLL_144M.
// ²ÎÊý: div: ¸ßËÙIOÊ±ÖÓ·ÖÆµÏµÊý.
// ·µ»Ø: none.
// °æ±¾: V1.0, 2022-04-03
//========================================================================
void HSPllClkConfig(u8 clksrc, u8 pllsel, u8 div)
{
	MainClockSel(clksrc);			//ÏµÍ³Ê±ÖÓÑ¡Ôñ, MCLKSEL_HIRC/MCLKSEL_XIRC/MCLKSEL_X32K/MCLKSEL_I32K/MCLKSEL_PLL/MCLKSEL_PLL2/MCLKSEL_I48M

	//ÏµÍ³Ê±ÖÓ n ·ÖÆµ×÷ÎªPLLÊ±ÖÓÔ´,È·±£·ÖÆµºóÎª12M
    USBCLK &= ~PCKI_MSK;
#if (MAIN_Fosc == 12000000UL)
    USBCLK |= PCKI_D1;          //PLLÊäÈëÊ±ÖÓ1·ÖÆµ
#elif (MAIN_Fosc == 24000000UL)
    USBCLK |= PCKI_D2;          //PLLÊäÈëÊ±ÖÓ2·ÖÆµ
#elif (MAIN_Fosc == 48000000UL)
    USBCLK |= PCKI_D4;          //PLLÊäÈëÊ±ÖÓ4·ÖÆµ
#elif (MAIN_Fosc == 96000000UL)
    USBCLK |= PCKI_D8;          //PLLÊäÈëÊ±ÖÓ8·ÖÆµ
#else
    USBCLK |= PCKI_D1;          //Ä¬ÈÏPLLÊäÈëÊ±ÖÓ1·ÖÆµ
#endif

	PLLClockSel(pllsel);			//PLLÊ±ÖÓÑ¡Ôñ, PLL_96M/PLL_144M
	PLLEnable(ENABLE);				//PLL±¶ÆµÊ¹ÄÜ, ENABLE/DISABLE
	delay_ms(1);              //µÈ´ýPLLËøÆµ
	HSIOClockSel(HSCK_PLL);		//¸ßËÙIOÊ±ÖÓÑ¡Ôñ, HSCK_MCLK/HSCK_PLL
	HSClockDiv(div);					//¸ßËÙIOÊ±ÖÓ·ÖÆµÏµÊý
}


