/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- BBS: www.STCAIMCU.com  -----------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* Èç¹ûÒªÔÚ³ÌÐòÖÐÊ¹ÓÃ´Ë´úÂë,ÇëÔÚ³ÌÐòÖÐ×¢Ã÷Ê¹ÓÃÁËSTCµÄ×ÊÁÏ¼°³ÌÐò            */
/*---------------------------------------------------------------------*/

#include "STC32G_LIN.h"

//========================================================================
// º¯Êý: u8 ReadReg(u8 addr)
// ÃèÊö: Lin¹¦ÄÜ¼Ä´æÆ÷¶ÁÈ¡º¯Êý¡£
// ²ÎÊý: Lin¹¦ÄÜ¼Ä´æÆ÷µØÖ·.
// ·µ»Ø: Lin¹¦ÄÜ¼Ä´æÆ÷Êý¾Ý.
// °æ±¾: VER1.0
// ÈÕÆÚ: 2021-01-05
// ±¸×¢: 
//========================================================================
u8 LinReadReg(u8 addr)
{
	u8 dat;
	LINAR = addr;
	dat = LINDR;
	return dat;
}

//========================================================================
// º¯Êý: void WriteReg(u8 addr, u8 dat)
// ÃèÊö: Lin¹¦ÄÜ¼Ä´æÆ÷ÅäÖÃº¯Êý¡£
// ²ÎÊý: Lin¹¦ÄÜ¼Ä´æÆ÷µØÖ·, Lin¹¦ÄÜ¼Ä´æÆ÷Êý¾Ý.
// ·µ»Ø: none.
// °æ±¾: VER1.0
// ÈÕÆÚ: 2021-01-05
// ±¸×¢: 
//========================================================================
void LinWriteReg(u8 addr, u8 dat)
{
	LINAR = addr;
	LINDR = dat;
}

//========================================================================
// º¯Êý: void LinReadMsg(u8 *pdat)
// ÃèÊö: Lin¶ÁÈ¡Êý¾Ýº¯Êý¡£
// ²ÎÊý: *pdat: ½ÓÊÕÊý¾Ý»º³åÇø.
// ·µ»Ø: none.
// °æ±¾: VER1.0
// ÈÕÆÚ: 2021-01-05
// ±¸×¢: 
//========================================================================
void LinReadMsg(u8 *pdat)
{
	u8 i;

	LinWriteReg(LSEL,0x80);	//µØÖ·×ÔÔö£¬´Ó0¿ªÊ¼
	for(i=0;i<FRAME_LEN;i++)
	{
		pdat[i] = LinReadReg(LBUF);
	}
}

//========================================================================
// º¯Êý: void LinSendMsg(u8 *pdat)
// ÃèÊö: LinÉèÖÃÊý¾Ýº¯Êý¡£
// ²ÎÊý: *pdat: ÉèÖÃÊý¾Ý»º³åÇø.
// ·µ»Ø: Lin ID.
// °æ±¾: VER1.0
// ÈÕÆÚ: 2021-01-05
// ±¸×¢: 
//========================================================================
void LinSendMsg(u8 *pdat)
{
	u8 i;

	LinWriteReg(LSEL,0x80);		//µØÖ·×ÔÔö£¬´Ó0¿ªÊ¼
	for(i=0;i<FRAME_LEN;i++)
	{
		LinWriteReg(LBUF,pdat[i]);
	}
}

//========================================================================
// º¯Êý: void LinSetID(u8 lid)
// ÃèÊö: ÉèÖÃLIN IDº¯Êý¡£
// ²ÎÊý: none.
// ·µ»Ø: none.
// °æ±¾: VER1.0
// ÈÕÆÚ: 2021-01-05
// ±¸×¢: 
//========================================================================
void LinSetID(u8 lid)
{
	LinWriteReg(LID,lid);			//ÉèÖÃ×ÜÏßID
}

//========================================================================
// º¯Êý: u8 GetLinError(void)
// ÃèÊö: »ñÈ¡LIN×ÜÏß´íÎó¼Ä´æÆ÷×´Ì¬¡£
// ²ÎÊý: none.
// ·µ»Ø: ´íÎó¼Ä´æÆ÷×´Ì¬.
// °æ±¾: VER1.0
// ÈÕÆÚ: 2021-01-05
// ±¸×¢: 
//========================================================================
u8 GetLinError(void)
{
	u8 sta;
	sta = LinReadReg(LER);		//¶ÁÈ¡Çå³ý´íÎó¼Ä´æÆ÷
	return sta;
}

//========================================================================
// º¯Êý: u8 WaitLinReady(void)
// ÃèÊö: µÈ´ýLIN×ÜÏß¾ÍÐ÷¡£
// ²ÎÊý: none.
// ·µ»Ø: LIN×ÜÏß×´Ì¬.
// °æ±¾: VER1.0
// ÈÕÆÚ: 2021-01-05
// ±¸×¢: 
//========================================================================
u8 WaitLinReady(void)
{
	u8 lsr;
	do{
		lsr = LinReadReg(LSR);
	}while(!(lsr & 0x02));		//ÅÐ¶Ïready×´Ì¬
	return lsr;
}

//========================================================================
// º¯Êý: void SendAbortCmd(void)
// ÃèÊö: Ö÷Ä£Ê½·¢ËÍLin×ÜÏßAbortº¯Êý¡£
// ²ÎÊý: none.
// ·µ»Ø: none.
// °æ±¾: VER1.0
// ÈÕÆÚ: 2021-01-05
// ±¸×¢: 
//========================================================================
void SendAbortCmd(void)
{
	LinWriteReg(LCR,0x80);		//Ö÷Ä£Ê½ Send Abort
}

//========================================================================
// º¯Êý: void SendHeadCmd(void)
// ÃèÊö: Ö÷Ä£Ê½·¢ËÍLin×ÜÏßHeaderº¯Êý¡£
// ²ÎÊý: none.
// ·µ»Ø: none.
// °æ±¾: VER1.0
// ÈÕÆÚ: 2021-01-05
// ±¸×¢: 
//========================================================================
void SendHeadCmd(void)
{
	LinWriteReg(LCR,0x81);		//Ö÷Ä£Ê½ Send Header
}

//========================================================================
// º¯Êý: void SendDatCmd(void)
// ÃèÊö: Ö÷Ä£Ê½·¢ËÍLin×ÜÏßÊý¾Ýº¯Êý¡£
// ²ÎÊý: none.
// ·µ»Ø: none.
// °æ±¾: VER1.0
// ÈÕÆÚ: 2021-01-05
// ±¸×¢: 
//========================================================================
void SendDatCmd(void)
{
	u8 lcr_val;
	lcr_val = 0x82+(LIN_MODE<<6)+(FRAME_LEN<<2);
	LinWriteReg(LCR,lcr_val);
}

//========================================================================
// º¯Êý: void ResponseTxCmd(void)
// ÃèÊö: ´ÓÄ£Ê½·¢ËÍLin×ÜÏßTx Responseº¯Êý¡£
// ²ÎÊý: none.
// ·µ»Ø: none.
// °æ±¾: VER1.0
// ÈÕÆÚ: 2021-01-05
// ±¸×¢: 
//========================================================================
void ResponseTxCmd(void)
{
	u8 lcr_val;
	lcr_val = 0x02+(LIN_MODE<<6)+(FRAME_LEN<<2);
	LinWriteReg(LCR,lcr_val);
}

//========================================================================
// º¯Êý: void ResponseRxCmd(void)
// ÃèÊö: ´ÓÄ£Ê½·¢ËÍLin×ÜÏßRx Responseº¯Êý¡£
// ²ÎÊý: none.
// ·µ»Ø: none.
// °æ±¾: VER1.0
// ÈÕÆÚ: 2021-01-05
// ±¸×¢: 
//========================================================================
void ResponseRxCmd(void)
{
	u8 lcr_val;
	lcr_val = 0x03+(LIN_MODE<<6)+(FRAME_LEN<<2);
	LinWriteReg(LCR,lcr_val);
}

//========================================================================
// º¯Êý: void LinTxResponse(u8 *pdat)
// ÃèÊö: Lin´Ó»ú·¢ËÍÓ¦´ðÊý¾Ý£¬¸úÖ÷»ú·¢ËÍµÄHeaderÆ´³ÉÒ»¸öÍêÕûµÄÖ¡¡£
// ²ÎÊý: *pdat: ·¢ËÍÊý¾Ý»º³åÇø.
// ·µ»Ø: none.
// °æ±¾: VER1.0
// ÈÕÆÚ: 2021-01-05
// ±¸×¢: 
//========================================================================
void LinTxResponse(u8 *pdat)
{
	LinSendMsg(pdat);
	ResponseTxCmd();					//TX response
	WaitLinReady();						//µÈ´ýready×´Ì¬
	GetLinError();						//¶ÁÈ¡Çå³ý´íÎó¼Ä´æÆ÷
}

//========================================================================
// º¯Êý: void LinReadFrame(u8 *pdat)
// ÃèÊö: Lin´Ó»ú½ÓÊÕÊý¾ÝÖ¡º¯Êý¡£
// ²ÎÊý: *pdat: ½ÓÊÕÊý¾Ý»º³åÇø.
// ·µ»Ø: none.
// °æ±¾: VER1.0
// ÈÕÆÚ: 2021-01-05
// ±¸×¢: 
//========================================================================
void LinReadFrame(u8 *pdat)
{
	ResponseRxCmd();					//RX response
	WaitLinReady();						//µÈ´ýready×´Ì¬
	GetLinError();						//¶ÁÈ¡Çå³ý´íÎó¼Ä´æÆ÷

	LinReadMsg(pdat);					//½ÓÊÕLin×ÜÏßÊý¾Ý
}

//========================================================================
// º¯Êý: void LinSendFrame(u8 lid, u8 *pdat)
// ÃèÊö: LinÖ÷»ú·¢ËÍÍêÕûÖ¡º¯Êý¡£
// ²ÎÊý: lid: Lin ID; *pdat: ·¢ËÍÊý¾Ý»º³åÇø.
// ·µ»Ø: none.
// °æ±¾: VER1.0
// ÈÕÆÚ: 2021-01-05
// ±¸×¢: 
//========================================================================
void LinSendFrame(u8 lid, u8 *pdat)
{
	LinSetID(lid);						//ÉèÖÃ×ÜÏßID
	LinSendMsg(pdat);

	SendHeadCmd();						//Ö÷Ä£Ê½ Send Seader
	WaitLinReady();						//µÈ´ýready×´Ì¬
	GetLinError();						//¶ÁÈ¡Çå³ý´íÎó¼Ä´æÆ÷

	SendDatCmd();							//Send Data
	WaitLinReady();						//µÈ´ýready×´Ì¬
	GetLinError();						//¶ÁÈ¡Çå³ý´íÎó¼Ä´æÆ÷
}

//========================================================================
// º¯Êý: void LinSendHeaderRead(u8 lid, u8 *pdat)
// ÃèÊö: LinÖ÷»ú·¢ËÍHeader£¬ÓÉ´Ó»ú·¢ËÍÓ¦´ðÊý¾Ý£¬Æ´³ÉÒ»¸öÍêÕûµÄÖ¡¡£
// ²ÎÊý: lid: ·¢ËÍÓ¦´ð´Ó»úµÄ×ÜÏßID; *pdat: ½ÓÊÕÊý¾Ý»º³åÇø.
// ·µ»Ø: none.
// °æ±¾: VER1.0
// ÈÕÆÚ: 2021-01-05
// ±¸×¢: 
//========================================================================
void LinSendHeaderRead(u8 lid, u8 *pdat)
{
	LinSetID(lid);						//ÉèÖÃ·¢ËÍResponse´Ó»ú×ÜÏßID

	SendHeadCmd();						//Ö÷Ä£Ê½ send header
	WaitLinReady();						//µÈ´ýready×´Ì¬
	GetLinError();						//¶ÁÈ¡Çå³ý´íÎó¼Ä´æÆ÷
	
	ResponseRxCmd();					//RX response
	WaitLinReady();						//µÈ´ýready×´Ì¬
	GetLinError();						//¶ÁÈ¡Çå³ý´íÎó¼Ä´æÆ÷

	LinReadMsg(pdat);				//½ÓÊÕLin×ÜÏß´Ó»ú·¢ËÍµÄÓ¦´ðÊý¾Ý
}

//========================================================================
// º¯Êý: void LinSetBaudrate(u16 brt)
// ÃèÊö: Lin×ÜÏß²¨ÌØÂÊÉèÖÃº¯Êý¡£
// ²ÎÊý: brt: ²¨ÌØÂÊ.
// ·µ»Ø: none.
// °æ±¾: VER1.0
// ÈÕÆÚ: 2021-01-05
// ±¸×¢: 
//========================================================================
void LinSetBaudrate(u16 brt)
{
	u16 tmp;
	tmp = (MAIN_Fosc >> 4) / brt;
	LinWriteReg(DLH,(u8)(tmp>>8));
	LinWriteReg(DLL,(u8)tmp);
}

//========================================================================
// º¯Êý: void LinSetHeadDelay(u8 base_ms, u8 prescaler)
// ÃèÊö: Lin×ÜÏßÉèÖÃÖ¡Í·ÑÓÊ±º¯Êý¡£
// ²ÎÊý: base_ms:ÑÓÊ±¼ÆÊý, prescaler:ÑÓÊ±·ÖÆµ.
// ·µ»Ø: none.
// °æ±¾: VER1.0
// ÈÕÆÚ: 2021-01-05
// ±¸×¢: 
//========================================================================
void LinSetHeadDelay(u8 base_ms, u8 prescaler)
{
	u16 tmp;
	tmp = (MAIN_Fosc * base_ms) / 1000;
	LinWriteReg(HDRH,(u8)(tmp>>8));
	LinWriteReg(HDRL,(u8)tmp);		//ÉèÖÃÖ¡Í·ÑÓÊ±¼ÆÊý

	LinWriteReg(HDP,prescaler);		//ÉèÖÃÖ¡Í·ÑÓÊ±·ÖÆµ
}

//========================================================================
// º¯Êý: void LIN_Inilize(LIN_InitTypeDef *LIN)
// ÃèÊö: LIN ³õÊ¼»¯³ÌÐò.
// ²ÎÊý: LIN: ½á¹¹²ÎÊý,Çë²Î¿¼LIN.hÀïµÄ¶¨Òå.
// ·µ»Ø: none.
// °æ±¾: V1.0, 2021-06-02
//========================================================================
void LIN_Inilize(LIN_InitTypeDef *LIN)
{
	if(LIN->LIN_Enable == ENABLE)	LINEN = 1;		//Ê¹ÄÜLINÄ£¿é
	else								LINEN = 0;		//¹Ø±ÕLINÄ£¿é

	GetLinError();						//¶ÁÈ¡Çå³ý´íÎó¼Ä´æÆ÷
	LinWriteReg(LIE,LIN->LIN_IE);		//LIEÖÐ¶ÏÊ¹ÄÜ¼Ä´æÆ÷
	LinSetBaudrate(LIN->LIN_Baudrate);	//ÉèÖÃ²¨ÌØÂÊ
	LinSetHeadDelay(LIN->LIN_HeadDelay,LIN->LIN_HeadPrescaler);	//ÉèÖÃÖ¡Í·ÑÓÊ±
}
