/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- BBS: www.STCAIMCU.com  -----------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* Èç¹ûÒªÔÚ³ÌÐòÖÐÊ¹ÓÃ´Ë´úÂë,ÇëÔÚ³ÌÐòÖÐ×¢Ã÷Ê¹ÓÃÁËSTCµÄ×ÊÁÏ¼°³ÌÐò            */
/*---------------------------------------------------------------------*/

#ifndef	__STC32G_EXTI_H
#define	__STC32G_EXTI_H

#include	"config.h"

//========================================================================
//                             Íâ²¿ÖÐ¶ÏÉèÖÃ
//========================================================================

#define 	INT0_Mode(n)		(n==0?(IT0 = 0):(IT0 = 1))	/* INT0ÖÐ¶ÏÄ£Ê½  ÏÂ½µÑØ/ÉÏÉý,ÏÂ½µÑØÖÐ¶Ï */
#define 	INT1_Mode(n)		(n==0?(IT1 = 0):(IT1 = 1))	/* INT0ÖÐ¶ÏÄ£Ê½  ÏÂ½µÑØ/ÉÏÉý,ÏÂ½µÑØÖÐ¶Ï */

//========================================================================
//                              ¶¨ÒåÉùÃ÷
//========================================================================

#define	EXT_INT0			0	//ÍâÖÐ¶Ï0
#define	EXT_INT1			1	//ÍâÖÐ¶Ï1
#define	EXT_INT2			2	//ÍâÖÐ¶Ï2
#define	EXT_INT3			3	//ÍâÖÐ¶Ï3
#define	EXT_INT4			4	//ÍâÖÐ¶Ï4

#define	EXT_MODE_RiseFall	0	//ÉÏÉýÑØ/ÏÂ½µÑØÖÐ¶Ï
#define	EXT_MODE_Fall			1	//ÏÂ½µÑØÖÐ¶Ï

typedef struct
{
	u8	EXTI_Mode;			//ÖÐ¶ÏÄ£Ê½,  	EXT_MODE_RiseFall, EXT_MODE_Fall
} EXTI_InitTypeDef;

extern u8 WakeUpSource;

u8	Ext_Inilize(u8 EXT, EXTI_InitTypeDef *INTx);

#endif
