/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- BBS: www.STCAIMCU.com  -----------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* Èç¹ûÒªÔÚ³ÌÐòÖÐÊ¹ÓÃ´Ë´úÂë,ÇëÔÚ³ÌÐòÖÐ×¢Ã÷Ê¹ÓÃÁËSTCµÄ×ÊÁÏ¼°³ÌÐò            */
/*---------------------------------------------------------------------*/

#ifndef	__STC32G_COMPARE_H
#define	__STC32G_COMPARE_H

#include	"config.h"

//========================================================================
//                              ¶¨ÒåÉùÃ÷
//========================================================================

#define	CMP_P_P37	0x00	//ÊäÈëÕý¼«ÐÔÑ¡Ôñ, 0: Ñ¡ÔñÄÚ²¿P3.7×öÕýÊäÈë
#define	CMP_P_P50	0x01	//ÊäÈëÕý¼«ÐÔÑ¡Ôñ, 1: Ñ¡ÔñÄÚ²¿P5.0×öÕýÊäÈë
#define	CMP_P_P51	0x02	//ÊäÈëÕý¼«ÐÔÑ¡Ôñ, 2: Ñ¡ÔñÄÚ²¿P5.1×öÕýÊäÈë
#define	CMP_P_ADC	0x03	//ÊäÈëÕý¼«ÐÔÑ¡Ôñ, 3: ÓÉADC_CHS[3:0]ËùÑ¡ÔñµÄADCÊäÈë¶Ë×öÕýÊäÈë.
#define	CMP_N_P36	0x00	//ÊäÈë¸º¼«ÐÔÑ¡Ôñ, 0: Ñ¡ÔñÍâ²¿P3.6×öÊäÈë.
#define	CMP_N_GAP	0x01	//ÊäÈë¸º¼«ÐÔÑ¡Ôñ, 1: Ñ¡ÔñÄÚ²¿BandGapµçÑ¹BGv×ö¸ºÊäÈë.

#define	CMPO_P34()	CMPO_S = 0	//½á¹ûÊä³öµ½P3.4.
#define	CMPO_P41()	CMPO_S = 1	//½á¹ûÊä³öµ½P4.1.

typedef struct
{ 
	u8	CMP_EN;					//±È½ÏÆ÷ÔÊÐí»ò½ûÖ¹, 			ENABLE,DISABLE
	u8	CMP_P_Select;		//±È½ÏÆ÷ÊäÈëÕý¼«Ñ¡Ôñ, CMP_P_P37: Ñ¡ÔñP3.7×öÕýÊäÈë, CMP_P_ADC: ÓÉADCÄ£ÄâÊäÈë¶Ë×öÕýÊäÈë.
	u8	CMP_N_Select;		//±È½ÏÆ÷ÊäÈë¸º¼«Ñ¡Ôñ, CMP_N_GAP: Ñ¡ÔñÄÚ²¿BandGap¾­¹ýOPºóµÄµçÑ¹×ö¸ºÊäÈë, CMP_N_P36: Ñ¡ÔñP3.6×ö¸ºÊäÈë.
	u8	CMP_Outpt_En;		//ÔÊÐí±È½Ï½á¹ûÊä³ö,   ENABLE,DISABLE
	u8	CMP_InvCMPO;		//±È½ÏÆ÷Êä³öÈ¡·´, ENABLE,DISABLE
	u8	CMP_100nsFilter;	//ÄÚ²¿0.1usÂË²¨,  ENABLE,DISABLE
	u8	CMP_OutDelayDuty;	//0~63, ±È½Ï½á¹û±ä»¯ÑÓÊ±ÖÜÆÚÊý
} CMP_InitDefine; 

void	CMP_Inilize(CMP_InitDefine *CMPx);

#endif
